# ForwardIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DimensionSegmentArray..::..ForwardIterator Method
DimensionSegmentArray Class See Also
---
Retrieve a forward moving iterator to the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual DimensionSegmentArrayIterator ForwardIterator()
```

Visual Basic
---
```text
Public Overridable Function ForwardIterator As DimensionSegmentArrayIterator
```

Visual C++
---
```text
public:
virtual DimensionSegmentArrayIterator^ ForwardIterator()
```

# ### Return Value
Returns a forward moving iterator to the array.
# See Also
DimensionSegmentArray Class
Autodesk.Revit.DB Namespace